ManuelGioino/electronica-informatica/firmware/esp32-cam/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "Arduino.h"
#include <PubSubClient.h>
extern PubSubClient mqttClient;
extern const char* mqtt_topic;
extern volatile bool capture_requested;
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// Face Detection will not work on boards without (or with disabled) PSRAM
#ifdef BOARD_HAS_PSRAM
#if CONFIG_IDF_TARGET_ESP32S3
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 1
#define CONFIG_ESP_FACE_DETECT_ENABLED      1
#else
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 0
#define CONFIG_ESP_FACE_DETECT_ENABLED      1
#endif
#else
#define CONFIG_ESP_FACE_DETECT_ENABLED      0
#define CONFIG_ESP_FACE_RECOGNITION_ENABLED 0
#endif

#if CONFIG_ESP_FACE_DETECT_ENABLED

#include <vector>
#include "human_face_detect_msr01.hpp"
#include "human_face_detect_mnp01.hpp"

#define TWO_STAGE 1 /*<! 1: detect by two-stage which is more accurate but slower(with keypoints). */
                    /*<! 0: detect by one-stage which is less accurate but faster(without keypoints). */

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
#pragma GCC diagnostic ignored "-Wformat"
#pragma GCC diagnostic ignored "-Wstrict-aliasing"
#include "face_recognition_tool.hpp"
#include "face_recognition_112_v1_s16.hpp"
#include "face_recognition_112_v1_s8.hpp"
#pragma GCC diagnostic error "-Wformat"
#pragma GCC diagnostic warning "-Wstrict-aliasing"

#define QUANT_TYPE 0  //if set to 1 => very large firmware, very slow, reboots when streaming...

#define FACE_ID_SAVE_NUMBER 7
#endif

#define FACE_COLOR_WHITE  0x00FFFFFF
#define FACE_COLOR_BLACK  0x00000000
#define FACE_COLOR_RED    0x000000FF
#define FACE_COLOR_GREEN  0x0000FF00
#define FACE_COLOR_BLUE   0x00FF0000
#define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
#define FACE_COLOR_CYAN   (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
#define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define LED_LEDC_GPIO            22  //configure LED pin
#define LED_LEDC_CHANNEL         4
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#if CONFIG_ESP_FACE_DETECT_ENABLED

static void reset_face_detection_filter();  // forward declaration

static int8_t detection_enabled = 0;
static bool last_face_detected = false;
static uint32_t face_event_count = 0;
static uint32_t last_face_seen_ms = 0;
static uint32_t last_face_change_ms = 0;
static uint8_t face_detect_hit_count = 0;
static uint8_t face_detect_miss_count = 0;

#define FACE_DETECT_CONFIRM_FRAMES 3
#define FACE_DETECT_CLEAR_FRAMES 4

static void set_face_detected(bool detected) {
  uint32_t now = millis();

  if (detected) {
    last_face_seen_ms = now;
  }

  if (detected == last_face_detected) {
    return;
  }

  last_face_detected = detected;
  last_face_change_ms = now;

  if (detected) {
    face_event_count++;
    Serial.println("CARA DETECTADA");
    mqttClient.publish(mqtt_topic, "cara_detectada");
    capture_requested = true;
    detection_enabled = 0;
    reset_face_detection_filter();
    Serial.println("Face detection DESACTIVADA tras deteccion.");
  } else {
    Serial.println("No hay cara");
  }
}

static void reset_face_detection_filter() {
  face_detect_hit_count = 0;
  face_detect_miss_count = 0;
}

void setDetectionEnabled(int8_t val) {
  detection_enabled = val;
  if (!detection_enabled) {
    reset_face_detection_filter();
    set_face_detected(false);
  }
}

static void update_face_detection_candidate(bool detected) {
  if (!detection_enabled) {
    reset_face_detection_filter();
    set_face_detected(false);
    return;
  }

  if (detected) {
    if (face_detect_hit_count < FACE_DETECT_CONFIRM_FRAMES) {
      face_detect_hit_count++;
    }
    face_detect_miss_count = 0;

    if (face_detect_hit_count >= FACE_DETECT_CONFIRM_FRAMES) {
      set_face_detected(true);
    }
    return;
  }

  if (face_detect_miss_count < FACE_DETECT_CLEAR_FRAMES) {
    face_detect_miss_count++;
  }
  face_detect_hit_count = 0;

  if (face_detect_miss_count >= FACE_DETECT_CLEAR_FRAMES) {
    set_face_detected(false);
  }
}

// #if TWO_STAGE
// static HumanFaceDetectMSR01 s1(0.1F, 0.5F, 10, 0.2F);
// static HumanFaceDetectMNP01 s2(0.5F, 0.3F, 5);
// #else
// static HumanFaceDetectMSR01 s1(0.3F, 0.5F, 10, 0.2F);
// #endif

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

#if QUANT_TYPE
// S16 model
FaceRecognition112V1S16 recognizer;
#else
// S8 model
FaceRecognition112V1S8 recognizer;
#endif
#endif

#endif

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

