ManuelGioino/electronica-informatica/firmware/esp32-cam/CameraWebServer/app_httpd.cpp
  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  ra_filter_init(&ra_filter, 20);

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
  recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");

  // load ids from flash partition
  recognizer.set_ids_from_flash();
#endif
  log_i("Starting web server on port: '%d'", config.server_port);
  httpd_uri_t options_uri_status      = { .uri = "/status",      .method = HTTP_OPTIONS, .handler = options_handler, .user_ctx = NULL };
  httpd_uri_t options_uri_face_status = { .uri = "/face-status", .method = HTTP_OPTIONS, .handler = options_handler, .user_ctx = NULL };
  httpd_uri_t options_uri_control     = { .uri = "/control",     .method = HTTP_OPTIONS, .handler = options_handler, .user_ctx = NULL };
  httpd_uri_t options_uri_capture     = { .uri = "/capture",     .method = HTTP_OPTIONS, .handler = options_handler, .user_ctx = NULL };

  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &face_status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);
    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &options_uri_status);
    httpd_register_uri_handler(camera_httpd, &options_uri_face_status);
    httpd_register_uri_handler(camera_httpd, &options_uri_control);
    httpd_register_uri_handler(camera_httpd, &options_uri_capture);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  httpd_uri_t options_uri_stream = { .uri = "/stream", .method = HTTP_OPTIONS, .handler = options_handler, .user_ctx = NULL };

  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
    httpd_register_uri_handler(stream_httpd, &options_uri_stream);
  }
}

void setupLedFlash(int pin) {
#if CONFIG_LED_ILLUMINATOR_ENABLED
  ledcSetup(LED_LEDC_CHANNEL, 5000, 8);
  ledcAttachPin(pin, LED_LEDC_CHANNEL);
#else
  log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
#endif
}
